In [1]:
import pandas as pd
import numpy as np
import numpy.random as randn
import string

* ### Series is just a single column on data
* ### Data frame is a collection of series

In [2]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [3]:
alphalist = list(string.ascii_uppercase)
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [4]:
index1 = [alphalist[i] for i in range(10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [5]:
series1 = pd.Series(data=data1,index=index1)
series1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [6]:
dico = {k:v for k,v in zip(index1,data1)}
dico

{'A': 0,
 'B': 1,
 'C': 2,
 'D': 3,
 'E': 4,
 'F': 5,
 'G': 6,
 'H': 7,
 'I': 8,
 'J': 9}

In [7]:
series2 = pd.Series(dico)
series2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [8]:
df = pd.DataFrame(np.random.randn(5,5),index='A/B/C/D/E'.split('/'), columns='V/W/X/Y/Z'.split("/"))
df

          V         W         X         Y         Z
A -0.322678 -0.005548 -0.117424 -1.098064  0.329041
B  0.579063 -1.314412 -0.399475  1.093089  1.412224
C -0.396302 -0.831586 -1.013764  0.327924  1.549156
D  1.551597 -2.068352  2.434136 -0.033687  0.771089
E -0.109392 -0.304850 -1.111442 -0.520245  0.813187

In [9]:
df.iloc[0]

V   -0.322678
W   -0.005548
X   -0.117424
Y   -1.098064
Z    0.329041
Name: A, dtype: float64

In [10]:
df.loc['A']

V   -0.322678
W   -0.005548
X   -0.117424
Y   -1.098064
Z    0.329041
Name: A, dtype: float64

In [11]:
df['W']

A   -0.005548
B   -1.314412
C   -0.831586
D   -2.068352
E   -0.304850
Name: W, dtype: float64

In [12]:
df[['W','Y']]

          W         Y
A -0.005548 -1.098064
B -1.314412  1.093089
C -0.831586  0.327924
D -2.068352 -0.033687
E -0.304850 -0.520245

In [13]:
# sELECTING COLUMNS
df[['V','X']]

          V         X
A -0.322678 -0.117424
B  0.579063 -0.399475
C -0.396302 -1.013764
D  1.551597  2.434136
E -0.109392 -1.111442

In [14]:
df.iloc[1]['X']

-0.3994750882312485

In [15]:
df.loc['B']['X']

-0.3994750882312485

In [16]:
df[['W','Y']]

          W         Y
A -0.005548 -1.098064
B -1.314412  1.093089
C -0.831586  0.327924
D -2.068352 -0.033687
E -0.304850 -0.520245

In [17]:
df.loc['D']

V    1.551597
W   -2.068352
X    2.434136
Y   -0.033687
Z    0.771089
Name: D, dtype: float64

### ACTVITY
BRING OUT FIGURES IN DX AND DZ

In [18]:
df.loc['D']['X'], df.loc['D']['Z']

(2.4341356787863804, 0.7710893059446935)

In [19]:
df.iloc[3]['X'], df.iloc[3]['Z']

(2.4341356787863804, 0.7710893059446935)

##### correction (mine is still correct):

In [20]:
df.loc['D'][['X','Z']]

X    2.434136
Z    0.771089
Name: D, dtype: float64

In [21]:
df[['X','Z']].loc['D']

X    2.434136
Z    0.771089
Name: D, dtype: float64

In [22]:
df[['X','Z']].iloc[3]

X    2.434136
Z    0.771089
Name: D, dtype: float64

### DONE

In [23]:
# We use iloc to select a particular row
df.iloc[0]

V   -0.322678
W   -0.005548
X   -0.117424
Y   -1.098064
Z    0.329041
Name: A, dtype: float64

In [24]:
# To select a particular value in a location, almost like a point on a graph
df.loc['B']['V']

0.5790629807956303

In [25]:
df['W']> 0

A    False
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [26]:
df[df['W']> 0]

Empty DataFrame
Columns: [V, W, X, Y, Z]
Index: []

In [27]:
# adding new column to the data frame
df['U'] = df['V']+df['Z']

In [28]:
df

          V         W         X         Y         Z         U
A -0.322678 -0.005548 -0.117424 -1.098064  0.329041  0.006363
B  0.579063 -1.314412 -0.399475  1.093089  1.412224  1.991287
C -0.396302 -0.831586 -1.013764  0.327924  1.549156  1.152854
D  1.551597 -2.068352  2.434136 -0.033687  0.771089  2.322686
E -0.109392 -0.304850 -1.111442 -0.520245  0.813187  0.703796

In [29]:
df['U'] > df['V']

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [30]:
df[df['U'] > df['V']]

          V         W         X         Y         Z         U
A -0.322678 -0.005548 -0.117424 -1.098064  0.329041  0.006363
B  0.579063 -1.314412 -0.399475  1.093089  1.412224  1.991287
C -0.396302 -0.831586 -1.013764  0.327924  1.549156  1.152854
D  1.551597 -2.068352  2.434136 -0.033687  0.771089  2.322686
E -0.109392 -0.304850 -1.111442 -0.520245  0.813187  0.703796

## df.head() this will return the first five rows of your data frame

In [31]:
df.head(2)

          V         W         X         Y         Z         U
A -0.322678 -0.005548 -0.117424 -1.098064  0.329041  0.006363
B  0.579063 -1.314412 -0.399475  1.093089  1.412224  1.991287

## df.tail() this will return the last five rows of your data frame

In [32]:
df.tail(2)

          V         W         X         Y         Z         U
D  1.551597 -2.068352  2.434136 -0.033687  0.771089  2.322686
E -0.109392 -0.304850 -1.111442 -0.520245  0.813187  0.703796

* # CONCATINATE

In [33]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3']},index =[0,1,2,3])

In [34]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7']},index =[0,1,2,3])

In [35]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [36]:
pd.concat([df1,df2], axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

"axis=0" will make rows, "axis=1" will make columns

# NEXT: MERGING AND JOINING DATA FRAME

* ## Merging

In [45]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [38]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [47]:
df_out = pd.merge(left,right, how='outer', on='key')
df_out

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [40]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']},
                   index=['K0','K1','K2','K3'])

right = pd.DataFrame({'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                    index=['K0','K1','K2','K3'])

In [41]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [42]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [43]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [44]:
display(left,right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [54]:
left = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K0','K1'],
                       'A':['A0','A1','A2','A3'],
                       'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                      'key2':['K0','K0','K0','K0'],
                       'C':['C0','C1','C2','C3'],
                       'D':['D0','D1','D2','D3']})

In [56]:
pd.merge(left,right, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1  NaN  NaN
2   K2   K0   A2   B2   C3   D3
3   K3   K1   A3   B3  NaN  NaN
4   K1   K0  NaN  NaN   C1   D1
5   K1   K0  NaN  NaN   C2   D2

In [57]:
pd.merge(left,right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C3  D3